<template>
    <div class="main">
        <div class="content">
            <div class="header">
                <h1>Классический рецепт</h1>
            </div>
            <div class="first-paragraph">
                <div class="text">
                    <p class="topic">ИНГРЕДИЕНТЫ:</p>
                    <p>
                        300 г муки, 120 г сахара, 1 ст. л. ванильного сахара, 1 яйцо, 
                        180 г масла, 1 ч. л. разрыхлителя,  щепотка соли,  180 г 
                        брусничного или малинового джема,  200 г сахарной пудры, 
                        сок 1 лимона, 2 ст. л. какао-порошка.
                     </p>
                 </div>
                 <div class="photo">
                     <img src="~/static/poloski.jpg">
                 </div>
            </div>
            <div class="second-paragraph">
                    <p class="step">Шаг 1</p>
                    Размягчите масло и взбейте его миксером с яйцом, 
                    обычным и ванильным сахаром добела.
                    <p class="step">Шаг 2</p>
                    Добавьте муку, просеянную с разрыхлителем и солью. 
                    Пальцами смешайте муку с масляной смесью так, чтобы 
                    получилась крошка. Соберите крошку в шар, заверните 
                    в пленку и положите в холодильник на 30 мин.
                    <p class="step">Шаг 3</p>
                    Затем раскатайте между двумя листами бумаги для выпечки 
                    в пласт по размеру противня, аккуратно по линейке обрежьте 
                    края. Перенесите тесто на противень, снимите верхний лист бумаги.
                    <p class="step">Шаг 4</p>
                    Выпекайте в разогретой до 190 °С духовке 12–15 мин. Разрежьте 
                    выпеченную лепешку на две равные части. Отложите 2 ст. л. джема, 
                    оставшийся джем равномерно выложите на одну часть лепешки. 
                    Сверху уложите вторую часть и слегка прижмите. 
                    Поверхность смажьте отложенным джемом. Важно делать все это, 
                    пока лепешки теплые.
                    <p class="step">Шаг 5</p>
                    Смешайте сахарную пудру с таким количеством лимонного сока, 
                    чтобы получилась текучая масса. Отложите пару ложек и смешайте с какао.
                    <p class="step">Шаг 6</p>
                    Полейте промазанные джемом лепешки получившейся глазурью и 
                    нарежьте полосками. Поверх глазури из кулинарного шприца
                    или бумажного «корнетика» выдавите полоски темной глазури 
                    с какао. Дайте глазури застыть полностью.
            </div>
        </div>
    </div>
</template>


<style scoped>
    .content{
        margin-top: 80px;
        display: flex;
        flex-direction: column;
        text-align: left;
    }
    .header{
        font-size: 64px;
        font-weight: bold;
    }
    .first-paragraph{
        margin-top: 40px;
        display: flex;
        font-size: 18px;
    }
    .text{
        max-width: 416px;
    }
    .topic{
        font-weight: bold;
        margin-bottom: 25px;
    }
    .second-paragraph{
        margin-top: 25px;
        font-size: 18px;
        font-style:italic;
        max-width: 677px;
    }
    .step{
        font-weight: bold;
        font-size: 20px;
    }
    img{
        width: 362px;
        height: 204px;
        margin-left: 72px;
    }
</style>
